brew "aichat"
brew "bat"
brew "broot"
brew "btop"
brew "composer"
brew "ctop"
brew "curl"
brew "dust"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glib"
brew "go"
brew "go-swagger"
brew "golang-migrate"
brew "golangci-lint"
brew "goose"
brew "helix"
brew "htop"
brew "hyperfine"
brew "jq"
brew "lazydocker"
brew "lcov"
brew "librdkafka"
brew "lighttpd"
brew "llvm"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "maven"
brew "mdbook"
brew "mockery"
brew "msgpack"
brew "neofetch"
brew "neovim"
brew "node"
brew "openjdk"
brew "openjdk@11"
brew "openssl@1.1"
brew "openssl@3"
brew "php"
brew "procs"
brew "protobuf"
brew "protoc-gen-go"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "sqlite"
brew "staticcheck"
brew "tmux"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "typescript"
brew "vegeta"
brew "wrk"
brew "x86_64-linux-gnu-binutils"
brew "mdbook"
brew "jdtls"
brew "gnupg"

# mac to linux gnu linker
tap "sergiobenitez/osxct"
brew "x86_64-unknown-linux-gnu"

# mac to linux musl linker
tap "filosottile/musl-cross"
brew "musl-cross"

# mac to windows mingw linker
brew "mingw-w64"

cask "font-code-new-roman-nerd-font"
cask "dbeaver-community"
cask "dotnet-sdk"
cask "mactex-no-gui"
cask "obsidian"
cask "orbstack"
cask "wezterm"
cask "visual-studio-code"
